{
    
    "1": [
        {
            "id": "1",
            "maintitle": "Auspicious Arrival of India’s First FSRU at H-Energy’s Jaigarh Terminal",
            "placedate": "Mumbai/Maharashtra 02nd Mar, 2022",
            "maincontent": "On the auspicious day of Mahashivrati, 1st March 2022, the Höegh Giant, India’s first Floating Storage and Regasification Unit (FSRU) arrived at H-Energy’s Jaigarh terminal in Maharashtra. This historic moment emphasises H-Energy’s commitment to be a significant contributor to the Indian LNG sector as well as it’s focus on sustainable and green energy solutions. With the berthing of the FSRU, it will now be gearing up towards commissioning it in the coming weeks.",            
            "content": [
                {
                    "title": "Technical Specifications of the FSRU",
                    "content": "The FSRU has a storage capacity of 170,000 cubic metres and has an installed re-gasification capacity of 750 million cubic feet per day (equivalent to ͌6million tons annually). The Höegh Giant will deliver re-gasified LNG to the 56-km long Jaigarh-Dabhol natural gas pipeline, connecting the LNG terminal to the national gas grid.Additionally, the facility will be capable of reloading LNG onto other LNG vessels for LNG supply to other terminals as well as reloading onto small-scale LNG vessels for bunkering services. The facility will also be capable of delivering LNG through truck loading facilities in near future for onshore retail distribution.The Höegh Giant is equipped with an open loop system using seawater as heating medium and is paired with propane closed loop intermediate regasification system which is an environment friendly system and does not have any adverse effect on surrounding seawater. This system has proven to be more efficient, robust and environment friendly compared to traditional regasification systems.Commenting on the development, the CEO of H-Energy said “We welcome the FSRU with immense pride to our Jaigarh terminal. This will be India’s first FSRU-based LNG terminal and it marks a new chapter in India’s mission for accelerated LNG infrastructure growth. We are proud to be part of India’s net-zero transition road map.”"
                }
                
            ]
        }
    ]
}